{
  "header": {
    "Main": "Главная",
    "Program": "Программа",
    "Registration": "Регистрация",
    "Contacts": "Контакты"
  },
  "introduction": {
    "WebsIsAn": "WebS – международная конференция для JavaScript-разработчиков.",
    "WebsBringsTogether": "WebS собирает вместе сотни JavaScript-разработчиков, готовых обсуждать новости стремительно развивающейся экосистемы, свежие инструменты, фреймворки и паттерны с экспертами из России.",
    "WebsProvidesWorkshops": "WebS – это воркшопы и доклады о технологиях от фронтенда до бэкенда, возможность пообщаться с теми, кто создаёт мир JavaScript и поучаствовать в кулуарных беседах, где и рождается будущее."
  },
  "preview": {
    "InternationalConference": "международная конференция",
    "RegisterNow": "Зарегистрироваться",
    "December": "декабря",
    "Year": "год"
  },
  "schedule": {
    "Program": "Программа",
    "AutomatingAService": "Автоматизируем сервис-воркер с Workbox 6",
    "StickStickCucumber": "Палка, палка, огуречик. Рисуем персонажную анимацию на CSS",
    "Workshop": "Воркшоп",
    "Report": "Доклад",
    "StateManagerArchitecture": "Архитектура менеджера состояния",
    "DependencyInversionTheory": "Теория и практика dependency inversion",
    "BlindPersonUser": "Пользовательский опыт незрячего человека",
    "ES6CollectionsUsing": "ES6-коллекции на примере V8: у ней внутре неонка",
    "CreationOfApplications": "Создание приложений для голосовых ассистентов: тренды, возможности, разработка"
  },
  "speakers": {
    "MaximSalnikov": "Максим Сальников",
    "ArtyomHarutyunyan": "Артём Арутюнян",
    "GCAstral": "ГК «Астрал»",
    "RomanDvornov": "Роман Дворнов",
    "AnatolyPopko": "Анатолий Попко",
    "DialogueInDark": "«Диалог в Темноте»",
    "AndreyPechkurov": "Андрей Печкуров",
    "VasilikaKlimova": "Василика Климова",
    "JuliaMiocen": "Юлия Миоцен",
    "Yandex": "Яндекс",
    "AndreyMelikhov": "Андрей Мелихов",
    "DmitryNikolaev": "Дмитрий Николаев",
    "AliceAwardWinner": "Победитель «Премии Алисы»"
  },
  "wish": {
    "DoYouWant": "Вы хотите стать спикером?",
    "IfYouAre": "Если вы разработчик и хотите выступить и поделиться своим опытом, заполните форму до 11 ноября.\n",
    "MoreDetails": "Подробнее"
  },
  "feedback": {
    "HaveQuestions": "Есть вопросы?",
    "Name": "Имя",
    "Message": "Сообщение",
    "Submit": "Отправить"
  },
  "features": {
    "WhatAwaitsYou": "Что вас ждет:",
    "TopSpeakers": "Топовые спикеры",
    "TheBestSpeakers": "Лучшие спикеры из крупных IT-компаний поделятся своими best practices, которые сами используют в процессе разработки.\n",
    "Workshops": "Воркшопы",
    "LearnMoreAbout": "Узнаете больше о сложной анимации в CSS, разберётесь, что такое инверсия зависимостей, а также напишите своё приложение для голосовых ассистентов.\n",
    "Atmosphere": "Атмосфера",
    "HundredsOf": "Сотни неравнодушных разработчиков и разработчиц встретятся вместе, чтобы посмотреть доклады от классных спикеров и поучаствовать в воркшопах.\n"
  },
  "capital": {
    "Greetings": "Мы приглашаем вас посетить международную конференцию по Web-разработке в городе Таганрог.",
    "MoviePremiere": "Премьера фильма «IT-столица России. Таганрог» под эгидой Института компьютерных технологий и информационной безопасности ЮФУ состоялась 7 августа. Героями стали представители IT-бизнеса - выпускники Южного федерального университета и власти г. Таганрога.",
    "CityFounder": "Этот город закладывался его основателем Петром Великим как будущая столица России. Однако, в 1698 г. этого не случилось. Мог ли предполагать Великий Император, что спустя 300 с небольшим лет этот город столицей все-таки станет.",
    "WelcomeToTaganrog": "Друзья, добро пожаловать в Таганрог.",
    "WelcomeToITCapital": "Добро пожаловать в IT-столицу России."
  },
  "culture": {
    "PreviewTitle": "Культурная программа",
    "PreviewText": "Во второй части нашей программы мы предлагаем вам посетить знаменитые места великолепного города Таганрог вместе с экскурсоводом и встретить закат у берегов Таганрогского залива.",
    "MainTitle": "Какие достопримечательности мы посетим",
    "FirstTitle": "Каменная лестница",
    "FirstText": "Лестницу построили на средства купца и мецената Г. Ф. Депальдо в 1823 году. В длину сооружение достигает 113 метров, в ширину доходит до 7 метров и состоит из более 140 ступенек и 13 площадок. В 1870-х годах по краям высадили деревья, в 1930-х в результате реконструкции добавили статуи в античном стиле, а у основания разбили сквер с фонтанами. Последняя реставрация достопримечательности проводилась в 2006 году.",
    "SecondTitle": "Дворец Алфераки",
    "SecondText": "Сооружение в греческом стиле, богато украшенное декоративной лепниной в манере барокко. Здание возвели в середине XIX века для богатого горожанина Н. Д. Алфераки по проекту петербургского архитектора А. И. Штакеншнейдера. Уже в конце столетия при содействии А. П. Чехова на его территории была организована краеведческая экспозиция, которая продолжает работать до сих пор. В музее представлены ценнейшие археологические коллекции, находки XI–XIII веков, а также предметы интерьера дворянских усадеб.",
    "ThirdTitle": "Домик Чехова",
    "ThirdText": "Музей, занимающий небольшой флигель, где появился на свет А.П. Чехов. Постройка была сооружена в середине XIX столетия из глинобитного кирпича на придомовой территории, принадлежавшей купцу А. Д. Гнутову (флигель сдавался в аренду). Музейная экспозиция заработала в 1920-х годах, через пару лет после открытия выставки вокруг здания посадили вишневый сад. вишневый сад.",
    "FourthTitle": "Дом Чайковского",
    "FourthText": "Кирпичный особняк конца XIX века, где в период 1883–94 года проживал Ипполит Чайковский – брат знаменитого композитора Петр Ильич посещал усадьбу несколько раз, о чем говори укрепленная на стене памятная табличка. После Революции здании поочередно размещались больница, библиотека концертный зал. Отдельную комнату-музей организовали в 1970-годах. Она работает как часть концертно-выставочного комплекса."
  },
  "about": {
    "WhereIs": "Где проходит",
    "TheCulturalProgram": "Культурная программа"
  },
  "additional": {
    "AlsoInProgram": "Кроме того в программе:",
    "ModernApproaches": "Современные подходы для создания PWA приложений.",
    "LargeJSON": "Проблемы больших JSON и их решение.",
    "HowBlindPeople": "Как видят сайты незрячие люди и как мы можем облегчить их жизнь.",
    "WhatsUnder": "Что у JS под капотом?"
  },
  "program": {
    "DeployedService": "«Задеплоил сервис-воркер — нужно покупать новый домен» — известная шутка о том, как сложно писать собственную логику кеширования. С приходом шестой версии библиотеки Workbox для прогрессивных веб-приложений (PWA) больше не нужен компромисс между гибкостью и удобством автоматизации сетевых задач. Я расскажу, как начать работу с Workbox 6, реализовать типовую функциональность для офлайнового веб-приложения и пойти дальше, добавив собственную логику кеширования.\n",
    "StateManagement": "Стейт-менеджмент — многогранный подход, который позволяет как обслуживать небольшие задачи для более детерминированного описания вычислительных процессов, так и строить целые архитектуры вокруг этого паттерна, чтобы решать проблемы зацепленности кода и автоматически оптимизировать производительность вычисления комплексных потоков данных. Реализация стейт-менеджмента изобилует особенностями и подводными камнями, которые в зависимости от задачи могут быть актуальными или нет. Об этом и поговорим.\n",
    "TheJSONFormat": "Формат JSON настолько прост — о чём тут можно говорить? И я так думал, пока не попробовал делать то, чего обычно не делают, ведь всё уже придумано до нас (спойлер: на самом деле нет). И оказалось, что JSON — богатый и плохо изученный мир с проблемами, которые можно решить, и это интересно. Доклад основан на моей работе в этом направлении, в частности над проблемами JSON большого (>100 MB) размера.\n",
    "OtlichayetsyaLiTo": "Отличается ли то, как зрячий и незрячий человек пользуются сайтом, как воспринимают его и управляют интерфейсом? И да и нет. В чём отличие и в чём сходство? Посмотрим на реальных примерах и обсудим, как создаются барьеры.",
    "TheJSdevelopers": "В инструментарий JS-разработчиков прочно вошли коллекции Map/Set, а также их Weak-вариации, появившиеся пять лет назад. Ныне их можно встретить как в популярных библиотеках, так и в Node.js core. При этом, как принято в ECMAScript, спецификация не задаёт жёстких требований к реализации стандарта, а лишь описывает поведение коллекций на высоком уровне, оставляя JS-движкам пространство для манёвра. Встречаются случаи, когда разработчику нужно понимать особенности реализации того же Map, чтобы принять взвешенное решение. Именно это и будет темой доклада. На примере V8 мы пройдёмся по конкретным алгоритмам, их сложности в пресловутой big O нотации, расходу памяти и прочей внутрянке коллекций Map/Set. Напоследок поговорим о том, как именно работают Weak-коллекции и почему WeakMap !== Map + WeakRef.\n",
    "ExpandingReality": "Расширяем реальность",
    "HowLongHave": "Как давно мы смотрим фильмы о виртуальной реальности — и как захватывающе она выглядит! Может, вы не заметили, но виртуальная и дополненная реальность уже встречается и в нашей жизни, в том числе и в браузерах. Появляется всё больше способов применять эти технологии. Давайте поближе познакомимся с VR и AR и посмотрим, как они разрабатываются в реале.\n",
    "HowToAssemble": "Как собрать анимацию абстрактных объектов — более-менее понятно. Но как анимировать персонажей и движение камеры, и всё это на CSS? Вместе пройдём весь процесс сборки небольшой анимашки на два персонажа: разбивку на ключевые кадры и планы, отрисовку простых и сложных объектов, отрисовку персонажей, анимацию и отладку.\n",
    "LetsFigure": "Разберёмся, что такое внедрение зависимости (dependency injection), как оно связано с инверсией зависимости (dependency inversion), зачем нужны IoC-контейнеры, что такое антипаттерн Service Locator и почему иногда внедрение зависимостей ещё не означает, что мы получили слабо связанный и легко поддерживаемый код.\n",
    "WhatIsTheMost": "Какой интерфейс можно назвать самым естественным? Конечно же, голос! За голосовыми приложениями не только будущее, но и настоящее. На воркшопе я расскажу об основных возможностях навыков Алисы и поделюсь опытом создания голосовых приложений. А все, кто пишут на Node.js, смогут разработать прототип собственного навыка Алисы.\n"
  },
  "attractions": {
    "WhatSights": "Какие достопримечательности мы посетим",
    "StoneStaircase": "Каменная лестница",
    "TheStaircaseWas": "Лестницу построили на средства купца и мецената Г. Ф. Депальдо в 1823 году. В длину сооружение достигает 113 метров, в ширину доходит до 7 метров и состоит из более 140 ступенек и 13 площадок. В 1870-х годах по краям высадили деревья, в 1930-х в результате реконструкции добавили статуи в античном стиле, а у основания разбили сквер с фонтанами. Последняя реставрация достопримечательности проводилась в 2006 году.\n",
    "AlferakiPalace": "Дворец Алфераки",
    "TheBuildingIs": "Сооружение в греческом стиле, богато украшенное декоративной лепниной в манере барокко. Здание возвели в середине XIX века для богатого горожанина Н. Д. Алфераки по проекту петербургского архитектора А. И. Штакеншнейдера. Уже в конце столетия при содействии А. П. Чехова на его территории была организована краеведческая экспозиция, которая продолжает работать до сих пор. В музее представлены ценнейшие археологические коллекции, находки XI–XIII веков, а также предметы интерьера дворянских усадеб.\n",
    "ChekhovsHouse": "Домик Чехова",
    "TheMuseumWhich": "Музей, занимающий небольшой флигель, где появился на свет А.П. Чехов. Постройка была сооружена в середине XIX столетия из глинобитного кирпича на придомовой территории, принадлежавшей купцу А. Д. Гнутову (флигель сдавался в аренду). Музейная экспозиция заработала в 1920-х годах, через пару лет после открытия выставки вокруг здания посадили вишневый сад. вишневый сад.\n",
    "TchaikovskyHouse": "Дом Чайковского",
    "ABrickMansion": "Кирпичный особняк конца XIX века, где в период 1883–94 года проживал Ипполит Чайковский – брат знаменитого композитора Петр Ильич посещал усадьбу несколько раз, о чем говори укрепленная на стене памятная табличка. После Революции здании поочередно размещались больница, библиотека концертный зал. Отдельную комнату-музей организовали в 1970-годах. Она работает как часть концертно-выставочного комплекса.\n"
  },
  "registration": {
    "Guest": "Гость",
    "Speaker": "Спикер",
    "Name": "Имя",
    "Surname": "Фамилия",
    "Telephone": "Телефон",
    "Password": "Пароль"
  }
}